app/controllers/properties_controller.rb

SELECT "properties".* FROM "properties" WHERE (aerial_image_file_name is NOT NULL and zpid is NULL) LIMIT 1
---
  def show
    @property = Property.find_by(id: params[:id])